# DATA WRANGLING
by Kanwar Hamza Shuja

# Creating dataframe

In [41]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

df = pd.DataFrame(
{"a" : [4, 5, 6], 
"b" : [7, 8, 9], 
"c" : [10, 11, 12]},    
index = [1, 2, 3])

In [42]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [43]:
#or another way is this

df1 = pd.DataFrame(
[[4, 8, 12],
[5, 10, 15],
[3, 6, 9]], 
index=[1, 2, 3], 
columns=['a', 'b', 'c'])

In [44]:
df1

   a   b   c
1  4   8  12
2  5  10  15
3  3   6   9

# Multiindexing

In [45]:
df=pd.DataFrame(
    {"a" : [4, 5, 6], 
    "b" : [7, 8, 9], 
    "c" : [10, 11, 12]},    
index= pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2),
     ('e', 3)], names=('N', 'M')))
print(df)

     a  b   c
N M
d 1  4  7  10
  2  5  8  11
e 3  6  9  12

# Reshaping the data

In [46]:
#Melt is for melting the data into a single column

pd.melt(df)

  variable  value
0        a      4
1        a      5
2        a      6
3        b      7
4        b      8
5        b      9
6        c     10
7        c     11
8        c     12

In [47]:
#for merging two tables together
df2=pd.concat([df,df1])
df2

        a   b   c
(d, 1)  4   7  10
(d, 2)  5   8  11
(e, 3)  6   9  12
1       4   8  12
2       5  10  15
3       3   6   9

In [48]:
df2=pd.DataFrame(
    { "a": [4, 7,10, 12, 15, 17], 
    "b": [5, 8, 11, 23, 12, 24],
    "c": [6, 9, 12, 15, 18, 21],
    "d": [4, 8, 12, 16, 20, 24],
    "e": [5, 10, 15, 20, 25, 30],
    "f": [3, 6, 9, 12, 15, 18]},
index= pd.MultiIndex.from_tuples([('g', 1), ('h', 2), ('i', 3), ('j', 4), ('k', 5), ('l', 6)],
    names= ['N', 'M']))
print(df2)

      a   b   c   d   e   f
N M
g 1   4   5   6   4   5   3
h 2   7   8   9   8  10   6
i 3  10  11  12  12  15   9
j 4  12  23  15  16  20  12
k 5  15  12  18  20  25  15
l 6  17  24  21  24  30  18

In [49]:
print(df2.columns)

Index(['a', 'b', 'c', 'd', 'e', 'f'], dtype='object')